Revit 2024 API
StructuralConnectionHandler.GetOrigin Method
 Retrieves origin point of Structural Connection Handler element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public XYZ GetOrigin()
Visual Basic
Public Function GetOrigin As XYZ
Visual C++
public:
XYZ^ GetOrigin()
Return Value
 The origin point of element.
See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace